Конфигурация/InformationRegisters/РеквизитыЮридическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРегистрационногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовЮридическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отрасли</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ПереопределениеКлассификацииУчетныхАктивовЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПереопределениеКлассификацииУчетныхАктивовЦБ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсходныйУчетныйАктивЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУчетныхАктивовЦБРФ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйУчетныйАктивЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУчетныхАктивовЦБРФ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлиентыДоверительногоУправления</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Эмитенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ТипыВекселей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыВекселей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дисконтный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процентный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/КатегорииОблигаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>КатегорииОблигаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Государственная</Name>
					<Comment>Государственная краткосрочная облигация</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субфедеральная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корпоративная</Name>
					<Comment>Корпоративная</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Еврооблигация</Name>
					<Comment>Еврооблигация</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Муниципальная</Name>
					<Comment>Облигация субъекта РФ, муниципальная облигация</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ипотечная</Name>
					<Comment>Ипотечная</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыКредитныхИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКредитныхИнструментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выданный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полученный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СчетаДоверительногоУправления</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Единый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Comment>заполняется автоматически</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитныйВклад</Name>
					<Comment>заполняется автоматически</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорБрокерскогоОбслуживания</Name>
					<Comment>заполняется автоматически</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаДоходовРасходов</Name>
					<Comment>заполняется автоматически</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>заполняется автоматически</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МНО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогашениеКупона</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеКредитногоИнструмента</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаСМО</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦеннойБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.СнятиеЦеннойБумагиСУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереводДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаСВалютой</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Comment>заполняется автоматически</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/ChartsOfAccounts/Единый.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<ChartOfAccounts>
		<Properties>
			<Name>Единый</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГлаваПланаСчетовНФО</Name>
					<Comment>Глава плана счетов некредитных финансовых организацй</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ГлавыПланаСчетовНФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

Конфигурация/CommonModules/БухгалтерскийУчетПовтИсп/Ext/Module.bsl
Функция ПолучитьЛицевойСчет(БалансовыйСчет, Валюта, Организация, СчетДоверительногоУправления, Знач Субконто1 = Неопределено, Знач Субконто2 = Неопределено, Знач Субконто3 = Неопределено, ДополнительнаяАналитика = Неопределено, Партия = Неопределено, СтрокаПартии = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена организация для определения лицевого счета");
	    Возврат Неопределено;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СчетДоверительногоУправления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен счет доверительного управления для определения лицевого счета");
	    Возврат Неопределено;
	КонецЕсли;
	
	БалансовыйСчетСтруктурой = БухгалтерскийУчет.РеквизитыСчета(БалансовыйСчет);
	КоличествоСубконто = БалансовыйСчетСтруктурой.ВидыСубконто.Количество();
	Если (КоличествоСубконто > 0 И Субконто1 = Неопределено И Не РаботаСМетаданнымиПовтИсп.НеПроверятьЗаполнениеСубконто(Организация, БалансовыйСчет, БалансовыйСчетСтруктурой.ВидыСубконто[0].ВидСубконто))
		ИЛИ (КоличествоСубконто > 1 И Субконто2 = Неопределено И Не РаботаСМетаданнымиПовтИсп.НеПроверятьЗаполнениеСубконто(Организация, БалансовыйСчет, БалансовыйСчетСтруктурой.ВидыСубконто[1].ВидСубконто)
		И ПланыВидовХарактеристик.ВидыСубконто.Сделка<>БалансовыйСчетСтруктурой.ВидыСубконто[1].ВидСубконто)
		ИЛИ КоличествоСубконто > 2 И Субконто3 = Неопределено И Не РаботаСМетаданнымиПовтИсп.НеПроверятьЗаполнениеСубконто(Организация, БалансовыйСчет, БалансовыйСчетСтруктурой.ВидыСубконто[2].ВидСубконто)
		Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено субконто для определения лицевого счета: " + БалансовыйСчетСтруктурой.Код);
	    Возврат Неопределено;
		
	КонецЕсли;
	
	Если ТипЗнч(Субконто2) = Тип("СправочникСсылка.ВидыДвиженияДенежныхСредств") Тогда
		Субконто2 = Неопределено;
	КонецЕсли;
	Если ТипЗнч(Субконто1) = Тип("СправочникСсылка.ВидыДвиженияДенежныхСредств") Тогда
		Субконто1 = Неопределено;
	КонецЕсли;
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЛицевыеСчета.Ссылка КАК Ссылка,
		|	ЛицевыеСчета.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
		|ГДЕ
		|	ЛицевыеСчета.СчетУчета = &СчетУчета
		|	И ЛицевыеСчета.Валюта = &Валюта
		|	И ЛицевыеСчета.Организация = &Организация
		|	И ЛицевыеСчета.Владелец = &СчетДоверительногоУправления
		|	И ЛицевыеСчета.Субконто1 = &Субконто1
		|	И ЛицевыеСчета.Субконто2 = &Субконто2
		|	И ЛицевыеСчета.Субконто3 = &Субконто3
		|	И ЛицевыеСчета.ДополнительнаяАналитика = &ДополнительнаяАналитика
		|	И ЛицевыеСчета.Партия = &Партия
		|	И ЛицевыеСчета.СтрокаПартии = &СтрокаПартии";
	
	Если Субконто1 = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Субконто1", "Неопределено");
	Иначе
		Запрос.УстановитьПараметр("Субконто1", Субконто1);
	КонецЕсли;
	Если Субконто2 = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Субконто2", "Неопределено");
	Иначе
		Запрос.УстановитьПараметр("Субконто2", Субконто2);
	КонецЕсли;
	Если Субконто3 = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Субконто3", "Неопределено");
	Иначе
		Запрос.УстановитьПараметр("Субконто3", Субконто3);
	КонецЕсли;
	Если ДополнительнаяАналитика = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительнаяАналитика", "Значение(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ПустаяСсылка)");
	Иначе
		Запрос.УстановитьПараметр("ДополнительнаяАналитика", ДополнительнаяАналитика);
	КонецЕсли;
	Если Партия = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Партия", "Неопределено");
	Иначе
		Запрос.УстановитьПараметр("Партия", Партия);
	КонецЕсли;
	Если СтрокаПартии = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СтрокаПартии", "0");
	Иначе
		Запрос.УстановитьПараметр("СтрокаПартии", СтрокаПартии);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СчетУчета", БалансовыйСчет);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если ВыборкаДетальныеЗаписи.ПометкаУдаления Тогда
			ЛицевойСчет = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ЛицевойСчет.УстановитьПометкуУдаления(Ложь, Ложь);
		КонецЕсли;	
	
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	Иначе
		
		НовыйЛицевой = Справочники.ЛицевыеСчета.СоздатьЭлемент();
		
		НовыйЛицевой.Владелец = СчетДоверительногоУправления;
		
		НовыйЛицевой.СчетУчета = БалансовыйСчет;
		НовыйЛицевой.Организация = Организация;
		НовыйЛицевой.Валюта = Валюта;
		Если Субконто1 <> Неопределено Тогда
			НовыйЛицевой.Субконто1 = Субконто1;
		КонецЕсли;
		Если Субконто2 <> Неопределено Тогда
			НовыйЛицевой.Субконто2 = Субконто2;
		КонецЕсли;
		Если Субконто3 <> Неопределено Тогда
			НовыйЛицевой.Субконто3 = Субконто3;
		КонецЕсли;
		Если ДополнительнаяАналитика <> Неопределено Тогда
			НовыйЛицевой.ДополнительнаяАналитика = ДополнительнаяАналитика;
		КонецЕсли;
		Если Партия <> Неопределено Тогда
			НовыйЛицевой.Партия = Партия;
		КонецЕсли;
		Если СтрокаПартии <> 0 Тогда
			НовыйЛицевой.СтрокаПартии = СтрокаПартии;
		КонецЕсли;
		
		НовыйЛицевой.Записать();
		
		Возврат НовыйЛицевой.Ссылка;
	
	КонецЕсли;
	
КонецФункции

Функция ОпределитьЦельРасчетаПоВидуУчета(ВидУчета) Экспорт
	
	ЦельРасчета = Справочники.ЦелиРасчета.ПустаяСсылка();
	
	Если ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет Тогда
		ЦельРасчета = Справочники.ЦелиРасчета.БухгалтерскийУчет;
	ИначеЕсли ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
		ЦельРасчета = Справочники.ЦелиРасчета.ЕдиныйПланСчетов;
	ИначеЕсли ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет Тогда
		ЦельРасчета = Справочники.ЦелиРасчета.НалоговыйУчет;
	КонецЕсли;
	
	Возврат ЦельРасчета;
	
КонецФункции

Функция ОпределитьВидУчетаПоЦелиРасчета(ЦельРасчета) Экспорт
	
	ВидУчета = Перечисления.ВидыУчета.ПустаяСсылка();
	
	Если ЦельРасчета = Справочники.ЦелиРасчета.БухгалтерскийУчет Тогда
		ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет;
	ИначеЕсли ЦельРасчета = Справочники.ЦелиРасчета.ЕдиныйПланСчетов Тогда
		ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет;
	ИначеЕсли ЦельРасчета = Справочники.ЦелиРасчета.НалоговыйУчет Тогда
		ВидУчета = Перечисления.ВидыУчета.НалоговыйУчет;
	КонецЕсли;
	
	Возврат ВидУчета;
	
КонецФункции

Функция СчетЯвляетсяГруппой(Счет) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Основной.Ссылка
		|ИЗ
		|	ПланСчетов." + РаботаСМетаданнымиПовтИсп.скПолучитьИмяПоСсылке(Счет) + " КАК Основной
		|ГДЕ
		|	Основной.Родитель = &Родитель";
		
	Запрос.УстановитьПараметр("Родитель", Счет);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции // СчетЯвляетсяГруппой

Функция ОпределитьНастройкиЦелиРасчета(Период, Организация, СчетДоверительногоУправления, ЦельРасчета) Экспорт
	Возврат БухгалтерскийУчет.ОпределитьНастройкиЦелиРасчета(Период, Организация, СчетДоверительногоУправления, ЦельРасчета);	
КонецФункции	

Функция ОпределитьНастройкиУчетаАктива(Период, Организация, СчетДоверительногоУправления, УчетныйАктив, ВидУчета) Экспорт
	Возврат БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(Период, Организация, СчетДоверительногоУправления, УчетныйАктив, ВидУчета);
КонецФункции	

Функция ОпределитьНастройкиУчета(Период, Организация, СчетДоверительногоУправления) Экспорт
	Возврат БухгалтерскийУчет.ОпределитьНастройкиУчета(Период, Организация, СчетДоверительногоУправления);
КонецФункции		

Функция РеквизитыСчета(Счет) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", Счет.Ссылка);
	Результат.Вставить("Код", Счет.Код);
	Результат.Вставить("Наименование", Счет.Наименование);
	Результат.Вставить("Порядок", Счет.Порядок);
	Результат.Вставить("Родитель", Счет.Родитель);
	Результат.Вставить("Вид", Счет.Вид);
	Результат.Вставить("Забалансовый", Счет.Забалансовый);
	Результат.Вставить("ПометкаУдаления", Счет.ПометкаУдаления);
	Результат.Вставить("Предопределенный", Счет.Предопределенный);
	Результат.Вставить("ИмяПредопределенныхДанных", Счет.ИмяПредопределенныхДанных);
	Результат.Вставить("Количественный", Счет.Количественный);
	Результат.Вставить("Валютный", Счет.Валютный);
	
	Если ТипЗнч(Счет) = Тип("ПланСчетовСсылка.Единый") Тогда
		Результат.Вставить("ГлаваПланаСчетовНФО", Счет.ГлаваПланаСчетовНФО);
	КонецЕсли;	
	
	ВидыСубконто = Новый ТаблицаЗначений;
	ВидыСубконто.Колонки.Добавить("НомерСтроки");
	ВидыСубконто.Колонки.Добавить("ВидСубконто");

	Для Каждого ВидСубконто Из Счет.ВидыСубконто Цикл
		СтрокаВидыСубконто = ВидыСубконто.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВидыСубконто, ВидСубконто);
	КонецЦикла;	
	
	Результат.Вставить("ВидыСубконто", ВидыСубконто);
	
	Возврат Результат;
	
КонецФункции // СчетСтруктурой

Функция ЭтоДолевойУчетныйАктивЦБРФ(УчетныйАктивЦБРФ) Экспорт

	УчетныеАктивЦБРФДолевые = Новый Массив();
	
	УчетныеАктивЦБРФДолевые.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИ);
	УчетныеАктивЦБРФДолевые.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИБанков);
	УчетныеАктивЦБРФДолевые.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИ);
	УчетныеАктивЦБРФДолевые.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИБанков);

	УчетныеАктивЦБРФДолевые.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ИСУ);
	УчетныеАктивЦБРФДолевые.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.КСУ);

	УчетныеАктивЦБРФДолевые.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПаиФондов);
	УчетныеАктивЦБРФДолевые.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентов);
	
    Возврат (УчетныеАктивЦБРФДолевые.Найти(УчетныйАктивЦБРФ) <> Неопределено);
	
КонецФункции

Функция ЭтоДолговойУчетныйАктивЦБРФ(УчетныйАктивЦБРФ) Экспорт

	УчетныеАктивЦБРФДолговые = Новый Массив();

	УчетныеАктивЦБРФДолговые.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов);
	УчетныеАктивЦБРФДолговые.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов);
	УчетныеАктивЦБРФДолговые.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов);
	УчетныеАктивЦБРФДолговые.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств);
	УчетныеАктивЦБРФДолговые.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства);
	УчетныеАктивЦБРФДолговые.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные);
	УчетныеАктивЦБРФДолговые.Добавить(Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов);
	
    Возврат (УчетныеАктивЦБРФДолговые.Найти(УчетныйАктивЦБРФ) <> Неопределено);
	
КонецФункции

Функция ЭтоДолевойУчетныйАктивЕПС(УчетныйАктивЕПС) Экспорт

	Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетныйАктивЕПС, "Родитель");
	Если Родитель = Справочники.УчетныеАктивыЕПС.ПустаяСсылка() Тогда
		РодительскийУчетныйАктивЕПС = УчетныйАктивЕПС;
	Иначе
		РодительскийУчетныйАктивЕПС = Родитель;
	КонецЕсли;

	РодительскиеУчетныеАктивЕПСДолевые = Новый Массив();
	
	РодительскиеУчетныеАктивЕПСДолевые.Добавить(Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажи);
	РодительскиеУчетныеАктивЕПСДолевые.Добавить(Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливой);

	Возврат (РодительскиеУчетныеАктивЕПСДолевые.Найти(РодительскийУчетныйАктивЕПС) <> Неопределено);
	
КонецФункции 

Функция ЭтоДолговойРодительскийАктивЕПС(УчетныйАктивЕПС) Экспорт

	Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетныйАктивЕПС, "Родитель");
	Если Родитель = Справочники.УчетныеАктивыЕПС.ПустаяСсылка() Тогда
		РодительскийУчетныйАктивЕПС = УчетныйАктивЕПС;
	Иначе
		РодительскийУчетныйАктивЕПС = Родитель;
	КонецЕсли;

	РодительскиеУчетныеАктивЕПСДолговые = Новый Массив();
	
	РодительскиеУчетныеАктивЕПСДолговые.Добавить(Справочники.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения);
	РодительскиеУчетныеАктивЕПСДолговые.Добавить(Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи);
	РодительскиеУчетныеАктивЕПСДолговые.Добавить(Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток);
	РодительскиеУчетныеАктивЕПСДолговые.Добавить(Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСД);

	Возврат (РодительскиеУчетныеАктивЕПСДолговые.Найти(РодительскийУчетныйАктивЕПС) <> Неопределено);
	
КонецФункции 

Функция ОпределитьУчетныйАктивЕПСПоКодуСчетаУчета(КодСчетаУчета) Экспорт

	Если СтрДлина(СокрЛП(КодСчетаУчета)) = 5 Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	УчетныеАктивыЕПС.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
			|ГДЕ
			|	УчетныеАктивыЕПС.СчетУчета.Код = &Код";
		
		Запрос.УстановитьПараметр("Код", КодСчетаУчета);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		     Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
		
	ИначеЕсли СтрДлина(СокрЛП(КодСчетаУчета)) = 3 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УчетныеАктивыЕПС.Родитель КАК Родитель
			|ИЗ
			|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
			|ГДЕ
			|	ПОДСТРОКА(УчетныеАктивыЕПС.СчетУчета.Код, 1, 3) = &Код";
		
		Запрос.УстановитьПараметр("Код", КодСчетаУчета);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		     Возврат ВыборкаДетальныеЗаписи.Родитель;
		КонецЕсли;
	
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции 

Функция ОпределитьУчетныйАктивЕПСПоРодителюИУчетномуАктивуЦБРФ(РодительскийУчетныйАктивЕПС, УчетныйАктивЦБРФ) Экспорт

	ЭтоДолевойАктив = ЭтоДолевойУчетныйАктивЦБРФ(УчетныйАктивЦБРФ);
	ЭтоДолговойАктив = ЭтоДолговойУчетныйАктивЦБРФ(УчетныйАктивЦБРФ);
	
	ЭтоДолевойРодительскийАктивЕПС = ЭтоДолевойУчетныйАктивЕПС(РодительскийУчетныйАктивЕПС);
	ЭтоДолговойРодительскийАктивЕПС = ЭтоДолговойРодительскийАктивЕПС(РодительскийУчетныйАктивЕПС);

	Если (НЕ ЭтоДолговойАктив И НЕ ЭтоДолевойАктив)
		ИЛИ (НЕ ЭтоДолевойРодительскийАктивЕПС И НЕ ЭтоДолговойРодительскийАктивЕПС)
		ИЛИ (ЭтоДолевойАктив <> ЭтоДолевойРодительскийАктивЕПС)
		ИЛИ (ЭтоДолговойАктив <> ЭтоДолговойРодительскийАктивЕПС) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если РодительскийУчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливой Тогда
	
		Если УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИ
			ИЛИ УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИ
			ИЛИ УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ИСУ
			ИЛИ УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.КСУ Тогда
			
			Возврат Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливойПрочихРезидентов;

		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИБанков
			ИЛИ УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИБанков Тогда
			
			Возврат Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливойКредитныхОрганизаций;	
			
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ПаиФондов
			ИЛИ УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентов Тогда
			
			Возврат Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливойПрочихРезидентов;
			
		КонецЕсли;
		
	ИначеЕсли РодительскийУчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажи Тогда

		Если УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИ
			ИЛИ УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИ
			ИЛИ УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ИСУ
			ИЛИ УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.КСУ Тогда
			
			Возврат Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажиПрочихРезидентов;

		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИБанков
			ИЛИ УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИБанков Тогда
			
			Возврат Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажиКредитныхОрганизаций;	
			
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ПаиФондов
			ИЛИ УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ПаиФондовНерезидентов Тогда
			
			Возврат Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажиПрочихРезидентов;
			
		КонецЕсли;
		
	ИначеЕсли РодительскийУчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток Тогда
		
		Если УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокРФ;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокСубъектовРФ;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокКредитныхОрганизаций;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокПрочихРезидентов;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокБанковНерезидентов;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокПрочихНерезидентов;
		КонецЕсли;
		
	ИначеЕсли РодительскийУчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи Тогда
		
		Если УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиРФ;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиСубъектовРФ;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиКредитныхОрганизаций;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиПрочихРезидентов;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиБанковНерезидентов;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиПрочихНерезидентов;
		КонецЕсли;
		
	ИначеЕсли РодительскийУчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСД Тогда
		
		Если УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСДРФ;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСДСубъектовРФ;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСДКредитныхОрганизаций;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСДПрочихРезидентов;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСДБанковНерезидентов;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСДПрочихНерезидентов;
		КонецЕсли;
		
	ИначеЕсли РодительскийУчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения Тогда
		
		Если УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиИДоПогашенияРФ;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиИДоПогашенияСубьектовРФ;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиИДоПогашенияКредитныхОрганизаций;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиИДоПогашенияПрочихРезидентов;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиИДоПогашенияБанковНерезидентов;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиИДоПогашенияПрочихНерезидентов;
		ИначеЕсли УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииИностранныхГосударств Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиИДоПогашенияИностранныхГосударств;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ОпределитьУчетныйАктивЕПСНаСервере(КодСчетаУчета, ЦеннаяБумага) Экспорт

	ТипыБумагПоКоторымОпределеныУчетныеАктивыЕПС = Новый Массив();
	
	ТипыБумагПоКоторымОпределеныУчетныеАктивыЕПС.Добавить(Тип("СправочникСсылка.Акции"));
	ТипыБумагПоКоторымОпределеныУчетныеАктивыЕПС.Добавить(Тип("СправочникСсылка.ИпотечныеСертификатыУчастия"));
	ТипыБумагПоКоторымОпределеныУчетныеАктивыЕПС.Добавить(Тип("СправочникСсылка.Облигации"));
	ТипыБумагПоКоторымОпределеныУчетныеАктивыЕПС.Добавить(Тип("СправочникСсылка.Паи"));
	
	Если ТипыБумагПоКоторымОпределеныУчетныеАктивыЕПС.Найти(ТипЗнч(ЦеннаяБумага)) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	УчетныйАктивЦБРФ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦеннаяБумага, "УчетныйАктивЦБРФ");
	
	РодительскийУчетныйАктивЕПС = ОпределитьУчетныйАктивЕПСПоКодуСчетаУчета(КодСчетаУчета);
	Если РодительскийУчетныйАктивЕПС = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОпределитьУчетныйАктивЕПСПоРодителюИУчетномуАктивуЦБРФ(РодительскийУчетныйАктивЕПС, УчетныйАктивЦБРФ);

КонецФункции 

Функция ДатаСКоторойПерестаемСписыватьКоличествоВМоментПолногоПогашения() Экспорт

	Возврат '20260101';

КонецФункции

Функция ПолучитьДанныеПарныхСчетов() Экспорт

	// #412969 - парные счета по максимуму тянем из учетных активов, там они проставлены, из регистра только расчеты и задолженности
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиА КАК АктивныйСчет,
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиП КАК ПассивныйСчет
		|ПОМЕСТИТЬ _ПарныеБумаг
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиА <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
		|	И УчетныеАктивыЕПС.СчетУчетаПереоценкиП <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
		|	И УчетныеАктивыЕПС.СчетУчетаПереоценкиА.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
		|	И УчетныеАктивыЕПС.СчетУчетаПереоценкиП.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|	И УчетныеАктивыЕПС.СчетУчетаПереоценкиА <> УчетныеАктивыЕПС.СчетУчетаПереоценкиП
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаКорректировокА,
		|	УчетныеАктивыЕПС.СчетУчетаКорректировокП
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	УчетныеАктивыЕПС.СчетУчетаКорректировокА <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
		|	И УчетныеАктивыЕПС.СчетУчетаКорректировокП <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
		|	И УчетныеАктивыЕПС.СчетУчетаКорректировокА.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
		|	И УчетныеАктивыЕПС.СчетУчетаКорректировокП.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|	И УчетныеАктивыЕПС.СчетУчетаКорректировокА <> УчетныеАктивыЕПС.СчетУчетаКорректировокП
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Дт,
		|	УчетныеАктивыЕПС.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Кт
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	УчетныеАктивыЕПС.СчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Дт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
		|	И УчетныеАктивыЕПС.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Кт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
		|	И УчетныеАктивыЕПС.СчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Дт.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
		|	И УчетныеАктивыЕПС.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Кт.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|	И УчетныеАктивыЕПС.СчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Дт <> УчетныеАктивыЕПС.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Кт
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Дт,
		|	УчетныеАктивыЕПС.СчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Кт
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	УчетныеАктивыЕПС.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Дт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
		|	И УчетныеАктивыЕПС.СчетУчетаОтрицательнойРазницыПервоначальногоПризнанияУровень3Кт <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
		|	И УчетныеАктивыЕПС.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Дт.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
		|	И УчетныеАктивыЕПС.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Дт.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|	И УчетныеАктивыЕПС.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Дт <> УчетныеАктивыЕПС.СчетУчетаПоложительнойРазницыПервоначальногоПризнанияУровень3Дт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ПарныеБумаг.АктивныйСчет, ПарныеСчетаЕПС.АктивныйСчет) КАК АктивныйСчет,
		|	ЕСТЬNULL(_ПарныеБумаг.ПассивныйСчет, ПарныеСчетаЕПС.ПассивныйСчет) КАК ПассивныйСчет
		|ИЗ
		|	РегистрСведений.ПарныеСчетаЕПС КАК ПарныеСчетаЕПС
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ПарныеБумаг КАК _ПарныеБумаг
		|		ПО ПарныеСчетаЕПС.АктивныйСчет = _ПарныеБумаг.АктивныйСчет
		|			И ПарныеСчетаЕПС.ПассивныйСчет = _ПарныеБумаг.ПассивныйСчет";
	
	ТаблицаПарныхСчетов =  Запрос.Выполнить().Выгрузить();
	ПарныеСчетаА = ТаблицаПарныхСчетов.ВыгрузитьКолонку("АктивныйСчет");
	ПарныеСчетаП = ТаблицаПарныхСчетов.ВыгрузитьКолонку("ПассивныйСчет");
	
	ПарныеСчетаА.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток39);
	ПарныеСчетаП.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток30);
	
	ПарныеСчетаА.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток66);
	ПарныеСчетаП.Добавить(ПланыСчетов.Единый.ДолговыеПрибыльУбыток67);
	
	ПарныеСчетаА.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи39);
	ПарныеСчетаП.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи30);
	
	ПарныеСчетаА.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи66);
	ПарныеСчетаП.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи67);
	
	ПарныеСчетаА.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД66);
	ПарныеСчетаП.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД67);
	
	ПарныеСчетаА.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения64);
	ПарныеСчетаП.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения65);
	
	Возврат Новый Структура("ПарныеСчетаА, ПарныеСчетаП", ПарныеСчетаА, ПарныеСчетаП);
	
КонецФункции

Функция ПолучитьМассивСчетовПереоценки() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиА КАК СчетУчетаПереоценки
		|ПОМЕСТИТЬ _СчетаПереоценки
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиА <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиП
		|ИЗ
		|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|ГДЕ
		|	УчетныеАктивыЕПС.СчетУчетаПереоценкиП <> ЗНАЧЕНИЕ(ПланСчетов.Единый.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_СчетаПереоценки.СчетУчетаПереоценки КАК СчетУчетаПереоценки
		|ИЗ
		|	_СчетаПереоценки КАК _СчетаПереоценки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Единый КАК Единый
		|		ПО _СчетаПереоценки.СчетУчетаПереоценки = Единый.Ссылка
		|ГДЕ
		|	Единый.Код ПОДОБНО ""5%""";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетУчетаПереоценки");

КонецФункции

Функция ПолучитьСвойстваСчета(Знач Счет) Экспорт

	ДанныеСчета = Новый Структура;
	ДанныеСчета.Вставить("Ссылка",             Неопределено);
	ДанныеСчета.Вставить("Наименование",       "");
	ДанныеСчета.Вставить("Код",                "");
	ДанныеСчета.Вставить("Родитель",           Неопределено);
	ДанныеСчета.Вставить("Вид",                Неопределено);
	ДанныеСчета.Вставить("Валютный",           Ложь);
	ДанныеСчета.Вставить("Количественный",     Ложь);
	ДанныеСчета.Вставить("КоличествоСубконто", 0);
	
	Если Не ЗначениеЗаполнено(Счет) Тогда
		Возврат ДанныеСчета;
	КонецЕсли;
	
	Для ИндексСубконто = 1 По РаботаСМетаданнымиПовтИсп.ПолучитьМаксимальноеКоличествоСубконто(Счет.Родитель) Цикл
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   Неопределено);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", Ложь);
	КонецЦикла;
	
	ДанныеСчета.Вставить("ИмяПланаСчетов",     РаботаСМетаданнымиПовтИсп.скПолучитьИмяПоСсылке(Счет));
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет", Счет);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Основной.Ссылка,
		|	Основной.Родитель,
		|	Основной.Код,
		|	Основной.Наименование,
		|	Основной.Вид,
		|	Основной.Валютный,
		|	Основной.Количественный
		|ИЗ
		|	ПланСчетов.Основной КАК Основной
		|ГДЕ
		|	Основной.Ссылка = &Счет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОсновнойВидыСубконто.НомерСтроки КАК НомерСтроки,
		|	ОсновнойВидыСубконто.ВидСубконто КАК ВидСубконто,
		|	ОсновнойВидыСубконто.ВидСубконто.Наименование КАК Наименование,
		|	ОсновнойВидыСубконто.ВидСубконто.ТипЗначения КАК ТипЗначения,
		|	ОсновнойВидыСубконто.ТолькоОбороты КАК ТолькоОбороты
		|ИЗ
		|	ПланСчетов.Основной.ВидыСубконто КАК ОсновнойВидыСубконто
		|ГДЕ
		|	ОсновнойВидыСубконто.Ссылка = &Счет
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОсновнойВидыСубконто.НомерСтроки";
	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланСчетов.Основной", "ПланСчетов." + ДанныеСчета.ИмяПланаСчетов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСчета, Выборка);
	КонецЕсли;
	
	ВыборкаВидыСубконто = МассивРезультатов[1].Выбрать();
		
	ДанныеСчета.КоличествоСубконто = ВыборкаВидыСубконто.Количество();
		
	ИндексСубконто = 0;
		
	Пока ВыборкаВидыСубконто.Следующий() Цикл
		ИндексСубконто = ИндексСубконто + 1;
		
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто,                   ВыборкаВидыСубконто.ВидСубконто);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "Наименование",  ВыборкаВидыСубконто.Наименование);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТипЗначения",   ВыборкаВидыСубконто.ТипЗначения);
		ДанныеСчета.Вставить("ВидСубконто" + ИндексСубконто + "ТолькоОбороты", ВыборкаВидыСубконто.ТолькоОбороты);
	КонецЦикла;
	
	Возврат ДанныеСчета;
	
КонецФункции

Функция СчетаВИерархии(СчетГруппа) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СчетГруппа) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетГруппа", СчетГруппа);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Основной.Ссылка КАК Счет
		|ИЗ
		|	ПланСчетов." + РаботаСМетаданнымиПовтИсп.скПолучитьИмяПоСсылке(СчетГруппа) + " КАК Основной
		|ГДЕ
		|	Основной.Ссылка В ИЕРАРХИИ(&СчетГруппа)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");

КонецФункции

Функция ОпределитьВидСубконтоУчетаЦеннойБумаги(Рынок) Экспорт
	
	Если      Рынок = Перечисления.РынкиЦенныхБумаг.Акции Тогда
		Возврат ПланыВидовХарактеристик.ВидыСубконто.Акции;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
		Возврат ПланыВидовХарактеристик.ВидыСубконто.Облигации;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Паи Тогда
		Возврат ПланыВидовХарактеристик.ВидыСубконто.Паи;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Векселя Тогда
		Возврат ПланыВидовХарактеристик.ВидыСубконто.Векселя;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Доли Тогда
		Возврат ПланыВидовХарактеристик.ВидыСубконто.Доли;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия Тогда 
		Возврат ПланыВидовХарактеристик.ВидыСубконто.ИпотечныеСертификатыУчастия;  
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.ДепозитарныеРасписки Тогда 
		Возврат ПланыВидовХарактеристик.ВидыСубконто.ДепозитарныеРасписки;  
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.ДрагоценныеМеталлы Тогда 
		Возврат ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги;  
	КонецЕсли;
	
	Возврат ПланыВидовХарактеристик.ВидыСубконто.ПустаяСсылка();
	
КонецФункции // ОпределитьВидСубконтоУчетаЦеннойБумаги

Функция ОпределитьУчетныйАктив(Период, Рынок, Актив, ЭтоКупон = Ложь) Экспорт
	
	ВалютаРубли	= ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль");
	
	Если Рынок = Перечисления.РынкиЦенныхБумаг.Акции Тогда
		Если Актив.ВалютаНоминала = ВалютаРубли Тогда
			Возврат Справочники.УчетныеАктивы.Акции;
		Иначе
			Возврат Справочники.УчетныеАктивы.АкцииИностранныхЭмитентов;	
		КонецЕсли;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Паи Тогда
		Если Актив.ВалютаНоминала = ВалютаРубли Тогда
			Возврат Справочники.УчетныеАктивы.Паи;
		Иначе
			Возврат Справочники.УчетныеАктивы.ПаиИностранныхЭмитентов;
		КонецЕсли;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.ДепозитарныеРасписки Тогда
		Возврат Справочники.УчетныеАктивы.ДепозитарныеРасписки;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия Тогда
		Возврат Справочники.УчетныеАктивы.ИпотечныеСертификатыУчастия;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Векселя Тогда
		Если Актив.ВалютаНоминала = ВалютаРубли Тогда
			Возврат ?(Актив.ТипВекселя = Перечисления.ТипыВекселей.Дисконтный, Справочники.УчетныеАктивы.ВекселяДисконтные, Справочники.УчетныеАктивы.ВекселяПроцентные);
		Иначе
			Возврат ?(Актив.ТипВекселя = Перечисления.ТипыВекселей.Дисконтный, Справочники.УчетныеАктивы.ВекселяДисконтныеВалютные, Справочники.УчетныеАктивы.ВекселяПроцентныеВалютные);
		КонецЕсли;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда	
		Если Актив.ВалютаНоминала <> ВалютаРубли Тогда
			Если Актив.Категория = Перечисления.КатегорииОблигаций.Государственная Тогда
				Если ЭтоКупон Тогда
					Возврат Справочники.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалютеКупон;
				Иначе
					Возврат Справочники.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалюте;
				КонецЕсли;	
			Иначе
				Если ЭтоКупон Тогда
					Возврат Справочники.УчетныеАктивы.ЕврооблигацииКупон;
				Иначе
					Возврат Справочники.УчетныеАктивы.Еврооблигации;
				КонецЕсли;	
			КонецЕсли;
		ИначеЕсли Период >= '2014-01-01 00:00:00' И Период <= '2015-03-31 23:59:59' Тогда
			//*********************************************************
			// 7ка целый год неправильно учитавала госкорпорации
			// она считала их госами!!!!!!!!!!!!!!!!
			Если Актив.Категория = Перечисления.КатегорииОблигаций.Корпоративная Тогда
				
				// определим, является ли эмитент гос. корпорацией
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	РеквизитыЮридическихЛицСрезПоследних.ОрганизационноПравоваяФорма
					|ИЗ
					|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, ЮрФизЛицо = &ЮрФизЛицо И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних";
					
				Запрос.УстановитьПараметр("Период",    Период);
				Запрос.УстановитьПараметр("ЮрФизЛицо", Актив.Эмитент.ЮрФизЛицо);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() И Выборка.ОрганизационноПравоваяФорма = Справочники.ОрганизационноПравовыеФормы.ГосударственнаяКорпорация Тогда
					Если ЭтоКупон Тогда
						Возврат Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон;
					Иначе
						Возврат Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальные;
					КонецЕсли;
				Иначе	
					Если ЭтоКупон Тогда
						Возврат Справочники.УчетныеАктивы.ОблигацииКорпоративныеКупон;
					Иначе
						Возврат Справочники.УчетныеАктивы.ОблигацииКорпоративные;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Если ЭтоКупон Тогда
					Возврат Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон;
				Иначе
					Возврат Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальные;
				КонецЕсли;
			КонецЕсли;
			//*********************************************************
		Иначе
			Если ЭтоКупон Тогда
				Если Актив.Категория = Перечисления.КатегорииОблигаций.Еврооблигация Тогда
					Возврат Справочники.УчетныеАктивы.ЕврооблигацииКупон;
				ИначеЕсли Актив.Категория = Перечисления.КатегорииОблигаций.Корпоративная ИЛИ Актив.Категория = Перечисления.КатегорииОблигаций.Ипотечная Тогда
					Возврат Справочники.УчетныеАктивы.ОблигацииКорпоративныеКупон;
				Иначе
					Возврат Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон;
				КонецЕсли;
			Иначе
				Если Актив.Категория = Перечисления.КатегорииОблигаций.Еврооблигация Тогда
					Возврат Справочники.УчетныеАктивы.Еврооблигации;
				ИначеЕсли Актив.Категория = Перечисления.КатегорииОблигаций.Корпоративная ИЛИ Актив.Категория = Перечисления.КатегорииОблигаций.Ипотечная Тогда
					Возврат Справочники.УчетныеАктивы.ОблигацииКорпоративные;
				Иначе
					Возврат Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальные;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Доли Тогда
		Возврат Справочники.УчетныеАктивы.Доли;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Фьючерсы Тогда
		Возврат Справочники.УчетныеАктивы.Фьючерсы;
	ИначеЕсли ТипЗнч(Актив) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		Возврат Справочники.УчетныеАктивы.ДепозитныеВклады;
	ИначеЕсли ТипЗнч(Актив) = Тип("СправочникСсылка.Займы") Тогда
		ДатаПогашенияЗайма = РаботаСКредитнымиИнструментами.ПолучитьДатуПогашенияКредитногоИнструмента(Актив, Период);
		Если Актив.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Выданный тогда
			Возврат Справочники.УчетныеАктивы.ЗаймыВыданные;
		ИначеЕсли ДатаПогашенияЗайма = Неопределено Тогда
			Возврат Неопределено;
		ИначеЕсли ДобавитьМесяц(ДатаПогашенияЗайма, -12) < Период Тогда
			Возврат Справочники.УчетныеАктивы.ЗаймыПолученныеКраткосрочные;
		Иначе
			Возврат Справочники.УчетныеАктивы.ЗаймыПолученныеДолгосрочные;
		КонецЕсли;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.ДрагоценныеМеталлы Тогда
		Возврат Справочники.УчетныеАктивы.ДрагоценныеМеталлы;
	КонецЕсли;

КонецФункции // ОпределитьУчетныйАктив

Функция ОпределитьПриоритетнуюКатегориюПриКлассификации(СчетДоверительногоУправления, Рынок, Период)

	Если Рынок = Перечисления.РынкиЦенныхБумаг.Акции ИЛИ Рынок = Перечисления.РынкиЦенныхБумаг.Паи Тогда
		Если СчетДоверительногоУправления = Неопределено Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливой;
		Иначе
			Настройка = БухгалтерскийУчет.ОпределитьНастройкуУчета(Период, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, "ПриоритетнаяКатегорияПриКлассификацииДолевыхЦенныхБумаг");
			Если НЕ ЗначениеЗаполнено(Настройка) Тогда
				Возврат Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливой;
			Иначе	
				Возврат Настройка;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
		Если СчетДоверительногоУправления = Неопределено Тогда
			Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток;
		Иначе
			Настройка = БухгалтерскийУчет.ОпределитьНастройкуУчета(Период, СчетДоверительногоУправления.Организация, СчетДоверительногоУправления, "ПриоритетнаяКатегорияПриКлассификацииДолговыхЦенныхБумаг");
			Если НЕ ЗначениеЗаполнено(Настройка) Тогда
				Возврат Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток;
			Иначе	
				Возврат Настройка;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ПолучитьПереопределенныеУчетныеАктивыЦБРФ(Период, СчетДоверительногоУправления) Экспорт

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _Клиент
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО (СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.Эмитент КАК Эмитент,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.ИсходныйУчетныйАктивЦБ КАК ИсходныйУчетныйАктивЦБ,
		|	ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних.НовыйУчетныйАктивЦБ КАК НовыйУчетныйАктивЦБ
		|ИЗ
		|	РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(
		|			&Период,
		|			(Организация, Клиент) В
		|				(ВЫБРАТЬ
		|					_Клиент.Организация,
		|					_Клиент.Клиент
		|				ИЗ
		|					_Клиент)) КАК ПереопределениеКлассификацииУчетныхАктивовЦБСрезПоследних");
	
	Запрос.УстановитьПараметр("Период",							Период);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	
	ПереопределенныеУчетныеАктивыЦБРФ = Запрос.Выполнить().Выгрузить();
	ПереопределенныеУчетныеАктивыЦБРФ.Индексы.Добавить("Эмитент, ИсходныйУчетныйАктивЦБ");
	
	Возврат ПереопределенныеУчетныеАктивыЦБРФ;

КонецФункции

Функция ПолучитьПереопределенныйУчетныйАктивЦБРФ(УчетныйАктивЦБРФ, Период, СчетДоверительногоУправления, Эмитент)

	Если СчетДоверительногоУправления = Неопределено Тогда
		Возврат УчетныйАктивЦБРФ;
	КонецЕсли;
	
	Если Период = '00010101' ИЛИ Период = Неопределено Тогда  
		ДатаНастроек = Период;
	ИначеЕсли ТипЗнч(Период) = Тип("Дата") ИЛИ ТипЗнч(Период) = Тип("Граница") Тогда
		ДатаНастроек = КонецДня(СистемныеФункции.ПолучитьДатуИзГраницы(Период));
	Иначе
		ВызватьИсключение СтрШаблон("Некорректный тип значения '%1' параметра 'Период'", ТипЗнч(Период));
	КонецЕсли;	
	
	ПереопределенныеУчетныеАктивыЦБРФ	= ПолучитьПереопределенныеУчетныеАктивыЦБРФ(ДатаНастроек, СчетДоверительногоУправления);
	ПереопределенныйУчетныйАктивЦБРФ	= ПереопределенныеУчетныеАктивыЦБРФ.НайтиСтроки(Новый Структура("Эмитент, ИсходныйУчетныйАктивЦБ", Эмитент, УчетныйАктивЦБРФ));
	УчетныйАктивЦБ						= ?(ПереопределенныйУчетныйАктивЦБРФ.Количество() = 0, УчетныйАктивЦБРФ, ПереопределенныйУчетныйАктивЦБРФ[0].НовыйУчетныйАктивЦБ);
	
	Возврат УчетныйАктивЦБ;

КонецФункции

Функция ОпределитьУчетныйАктивЕПС(Период, Рынок, Актив, СчетДоверительногоУправления = Неопределено) Экспорт

	Эмитент = Неопределено;
	
	Если Рынок = Перечисления.РынкиЦенныхБумаг.Акции Тогда
		
		АктивУчетныйАктивЦБРФ = ПолучитьПереопределенныйУчетныйАктивЦБРФ(Актив.УчетныйАктивЦБРФ, Период, СчетДоверительногоУправления, Актив.Эмитент);
		
		ПриоритетнаяКатегория = ОпределитьПриоритетнуюКатегориюПриКлассификации(СчетДоверительногоУправления, Рынок, Период);
		
		Если ПриоритетнаяКатегория = Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажи Тогда
			Если АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИБанков
				ИЛИ АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИБанков Тогда
			
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажиКредитныхОрганизаций;
				
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИ
				ИЛИ АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИ Тогда
				
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажиПрочихРезидентов;
				
			Иначе //незаполнено или что- то непонятное
				
				Если Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(Актив.Эмитент.ЮрФизЛицо, "Банки") = Неопределено Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажиПрочихРезидентов;
				Иначе
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеДляПродажиКредитныхОрганизаций;
				КонецЕсли;
				
			КонецЕсли;
		Иначе			
			Если АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИБанков
				ИЛИ АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИБанков Тогда
			
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливойКредитныхОрганизаций;
				
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АОИ
				ИЛИ АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.АПИ Тогда
				
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливойПрочихРезидентов;
				
			Иначе //незаполнено или что- то непонятное
				
				Если Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(Актив.Эмитент.ЮрФизЛицо, "Банки") = Неопределено Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливойПрочихРезидентов;
				Иначе
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливойКредитныхОрганизаций;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Паи Тогда
		//пока отправим на "посправедливой"
		
		// для паев нет возможности получать данные из <<УчетныйАктивЦБРФ>>
		УправляющаяКомпания = Справочники.УправляющиеКомпании.ПолучитьУправляющуюКомпаниюПИФДляПаяНаДату(Период, Актив);
		УправляющаяКомпания_ЮрЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УправляющаяКомпания, "ЮрФизЛицо");
		Если Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(УправляющаяКомпания_ЮрЛицо, "Банки") = Неопределено Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливойПрочихРезидентов;
		Иначе
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолевыеПоСправедливойКредитныхОрганизаций;
		КонецЕсли;
		
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.ДепозитарныеРасписки Тогда
		// К.Б.:  ДР классифицируются по базовому активу
		УчетныйАктивЦБРФ =  ОпределитьУчетныйАктивЕПС(Период, Перечисления.РынкиЦенныхБумаг.Акции, Актив.БазоваяЦБ, СчетДоверительногоУправления);
		
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия Тогда
		// а Х.З.
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Векселя Тогда
		
		Если Актив.Эмитент.ЮрФизЛицо = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_МинфинРоссии") Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ВекселяДоПогашенияРФ;
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РеквизитыЮридическихЛицСрезПоследних.ОрганизационноПравоваяФорма КАК ОрганизационноПравоваяФорма,
				|	РеквизитыЮридическихЛицСрезПоследних.СтранаРегистрации КАК СтранаРегистрации
				|ИЗ
				|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
				|			&Период,
				|			ЮрФизЛицо = &ЮрФизЛицо
				|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних";
				
			Запрос.УстановитьПараметр("Период",    Период);
			Запрос.УстановитьПараметр("ЮрФизЛицо", Актив.Эмитент.ЮрФизЛицо);
			
			ОПФ = Справочники.ОрганизационноПравовыеФормы.ПубличноеАкционерноеОбщество; // по умолчанию некое юр.лицо
			Страна = Справочники.СтраныМира.Россия;
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ОПФ = Выборка.ОрганизационноПравоваяФорма;
				Страна = Выборка.СтранаРегистрации;
			КонецЕсли;
			КредитнаяОрганизация = (Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(Актив.Эмитент.ЮрФизЛицо, "Банки") <> Неопределено);
			
			Если Страна = Справочники.СтраныМира.Россия Тогда
				Если ОПФ = Справочники.ОрганизационноПравовыеФормы.ГосударственноеПредприятие Тогда
					Возврат Справочники.УчетныеАктивыЕПС.ВекселяДоПогашенияСубъектовРФ;	
				ИначеЕсли КредитнаяОрганизация Тогда
					Возврат Справочники.УчетныеАктивыЕПС.ВекселяДоПогашенияКредитныхОрганизаций;
				Иначе
					Возврат Справочники.УчетныеАктивыЕПС.ВекселяДоПогашенияПрочихРезидентов;
				КонецЕсли;
			Иначе
				Если ОПФ = Справочники.ОрганизационноПравовыеФормы.ГосударственноеПредприятие Тогда
					Возврат Справочники.УчетныеАктивыЕПС.ВекселяДоПогашенияИностранныхГосударств;	
				ИначеЕсли КредитнаяОрганизация Тогда
					Возврат Справочники.УчетныеАктивыЕПС.ВекселяДоПогашенияБанковНерезидентов;
				Иначе
					Возврат Справочники.УчетныеАктивыЕПС.ВекселяДоПогашенияПрочихНерезидентов;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		// пока на долговые по амортизации
		Если Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(Актив.Эмитент.ЮрФизЛицо, "Банки") = Неопределено Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСДПрочихРезидентов;
		Иначе
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПСДКредитныхОрганизаций;
		КонецЕсли;
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Облигации Тогда
		
		АктивУчетныйАктивЦБРФ = ПолучитьПереопределенныйУчетныйАктивЦБРФ(Актив.УчетныйАктивЦБРФ, Период, СчетДоверительногоУправления, Актив.Эмитент);
		
		ПриоритетнаяКатегория = ОпределитьПриоритетнуюКатегориюПриКлассификации(СчетДоверительногоУправления, Рынок, Период);
		
		Если ПриоритетнаяКатегория = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажи Тогда
			Если АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиРФ;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиСубъектовРФ;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиКредитныхОрганизаций;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиПрочихРезидентов;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиБанковНерезидентов;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиПрочихНерезидентов;
			Иначе
				Если Актив.Категория = Перечисления.КатегорииОблигаций.Государственная Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиРФ;
				ИначеЕсли Актив.Категория = Перечисления.КатегорииОблигаций.Субфедеральная
						  ИЛИ Актив.Категория = Перечисления.КатегорииОблигаций.Муниципальная Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиСубъектовРФ;
				ИначеЕсли Актив.УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиКредитныхОрганизаций;
				ИначеЕсли Актив.УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиПрочихРезидентов;
				ИначеЕсли Актив.УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиБанковНерезидентов;
				Иначе
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеДляПродажиПрочихНерезидентов;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииГосударства Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокРФ;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииСубфедеральные Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокСубъектовРФ;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокКредитныхОрганизаций;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихРезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокПрочихРезидентов;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокБанковНерезидентов;
			ИначеЕсли АктивУчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов Тогда
				УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокПрочихНерезидентов;
			Иначе
				Если Актив.Категория = Перечисления.КатегорииОблигаций.Государственная Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокРФ;
				ИначеЕсли Актив.Категория = Перечисления.КатегорииОблигаций.Субфедеральная
						  ИЛИ Актив.Категория = Перечисления.КатегорииОблигаций.Муниципальная Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокСубъектовРФ;
				ИначеЕсли Актив.УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковРезидентов Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокКредитныхОрганизаций;
				ИначеЕсли Актив.УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииПрочихНерезидентов Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокПрочихНерезидентов;
				ИначеЕсли Актив.УчетныйАктивЦБРФ = Справочники.КлассификаторУчетныхАктивовЦБРФ.ОблигацииБанковНерезидентов Тогда
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокБанковНерезидентов;
				Иначе
					УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбытокПрочихРезидентов;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Фьючерсы Тогда
		
		// #ТехническийДолг - 28/10/17 - если никто не возвражает, так буду помечать те вещи, которые потом нужно будет переделать
		
		// АД!!!!
		НаименованиеАктива = Лев(Актив.Наименование, СтрНайти(Актив.Наименование, "-") - 1);
		
		Индексы = "RTS,MXI,MIX,RVI";
		Акции = "SBRF,GAZR,LKOH,VTBR,SBPR,MGNT,ROSN,HYDR,GMKR,SNGP,FEES,ALRS,MOEX,SNGR,RTKM,NLMK,AFLT,TATN,CHMF,NOTK,MTSI,TRNF";
		Облигации = "OF10,OFZ4,OFZ2,OF15,OFZ6";
		Валюта = "Si,ED,Eu,UJPY,GBPU,AUDU,UCAD,UCHF";
		ПроцентныеСтавки = "RUON";
		ТоварныеКонтракты = "BR,GOLD,SILV,PLT,PLD";
		
		Если СтрНайти(Индексы, НаименованиеАктива) > 0 Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ПроизводныеФинансовыеИнструментыОснованныеНаДолевыхИнструментах;
		ИначеЕсли СтрНайти(Акции, НаименованиеАктива) > 0 Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ПроизводныеФинансовыеИнструментыОснованныеНаДолевыхИнструментах;
		ИначеЕсли СтрНайти(Облигации, НаименованиеАктива) > 0 Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ПроизводныеФинансовыеИнструментыОснованныеНаПроцентныхДоговорах;
		ИначеЕсли СтрНайти(Валюта, НаименованиеАктива) > 0 Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ПроизводныеФинансовыеИнструментыОснованныеНаВалютныхДоговорах;
		ИначеЕсли СтрНайти(ПроцентныеСтавки, НаименованиеАктива) > 0 Тогда
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ПроизводныеФинансовыеИнструментыОснованныеНаПроцентныхДоговорах;
		Иначе
			УчетныйАктивЦБРФ = Справочники.УчетныеАктивыЕПС.ПроизводныеФинансовыеИнструментыОснованныеНаПрочихДоговорах;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Актив) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		
		УчетныйАктивЦБРФ = Справочники.ДепозитныеВклады.ОпределитьУчетныйАктивДепозита(Актив, Период);
		
	КонецЕсли;
	
	Возврат УчетныйАктивЦБРФ;
	
КонецФункции

// Возвращает дату начала учета резервов по ЗПИФ в бухгалтерском учете
Функция ПолучитьДатуНачалаУчетаРезервовЗПИФВБухУчете() Экспорт
	Возврат Дата(2019, 1, 1);
КонецФункции
